Revit 2026 API

# DocumentNewRoom(Room, PlanCircuit) Method

---

Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room NewRoom(
	Room room,
	PlanCircuit circuit
)
```
```vb
Public Function NewRoom (
	room As Room,
	circuit As PlanCircuit
) As Room
```
```cpp
public:
Room^ NewRoom(
	Room^ room,
	PlanCircuit^ circuit
)
```
```fsharp
member NewRoom :
        room : Room *
        circuit : PlanCircuit -> Room
```

#### Parameters

room Room
     The room which you want to locate in the circuit. Pass  to create a new room.
circuit PlanCircuit
     The circuit in which you want to locate a room.

#### Return Value

Room If successful the room is returned, otherwise .

| Exception | Condition |
| --- | --- |
| InvalidOperationException | If the existing room is already placed. |
| ArgumentException | Thrown if the room does not exist in the given document. |
| ArgumentException | Thrown if the circuit does not exist in the given document. |
| InvalidOperationException | Thrown if the level obtained from the circuit has no associated view . |

This method will regenerate the document even in manual regeneration mode.

#### Reference

Document Class

NewRoom Overload

Autodesk.Revit.Creation Namespace